Ran Plan for project: `org-read` dir: `org-read` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.aws_iam_policy_document.tags_read: Reading...
data.aws_iam_policy.org_readonly_access: Reading...
data.aws_iam_policy_document.tags_read: Read complete after 0s [id=2844959228]
data.aws_iam_policy_document.org_read_assume: Reading...
data.aws_iam_policy_document.org_read_assume: Read complete after 0s [id=1043166667]
data.aws_iam_policy.org_readonly_access: Read complete after 1s [id=arn:aws:iam::aws:policy/AWSOrganizationsReadOnlyAccess]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_role.org_read will be created
+ resource "aws_iam_role" "org_read" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + "sts:ExternalId" = "external-340c+b540,d21b/43b4:8979=2749@e0d3.13c4"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::880584957794:role/dev-stacklet-platform",
                              + "arn:aws:iam::880584957794:role/dev-collector",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Access to read accounts information for atlantis Stacklet deployment"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "atlantis-org-read"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.tags_read will be created
+ resource "aws_iam_role_policy" "tags_read" {
      + id          = (known after apply)
      + name        = "AllowBulkTagRead"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "tag:GetResources"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachments_exclusive.org_read will be created
+ resource "aws_iam_role_policy_attachments_exclusive" "org_read" {
      + policy_arns = [
          + "arn:aws:iam::aws:policy/AWSOrganizationsReadOnlyAccess",
        ]
      + role_name   = "atlantis-org-read"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ org_read_role = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p org-read
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://python.atlantis.stacklet.dev/lock?id=stacklet%252Fterraform-aws-onboarding%252Forg-read%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p org-read
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```